Reports/СвободныеНомераРТУиСФ_УТ10.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СвободныеНомераРТУиСФ_УТ10</Name>
			<Comment>UT10-3735</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаНомераСФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаНомераРТУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаНомеров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Префикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Постфикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧисловой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаНомера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПрефиксов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Префикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Постфикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаНомера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СвободныеНомераРТУиСФ_УТ10/Ext/ObjectModule.bsl
Процедура ПодготовитьТаблицуПрефиксовРТУиСФ()
	
	ДлинаНомераСФ = 11;
	ДлинаНомераРТУ = 11;
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
	ТаблицаНомеров.Очистить();
	Префикс        = Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить() + Организация.Префикс;	
	Стр = ТаблицаПрефиксов.Добавить();
	Стр.ВидДокумента  = "РеализацияТоваровУслуг";
	Стр.ДлинаНомера   = ДлинаНомераСФ;
	Стр.Организация   = Организация;
	Стр.Префикс       = Префикс;

	Стр = ТаблицаПрефиксов.Добавить();
	Стр.ВидДокумента  = "СчетФактураВыданный";
	Стр.ДлинаНомера   = ДлинаНомераСФ;
	Стр.Организация   = Организация;
	Стр.Префикс       = Префикс;
	
КонецПроцедуры

Процедура ЗаполнитьСвободныеНомера(ВидДокумента)
	
	НайдСтроки = ТаблицаПрефиксов.НайтиСтроки(Новый Структура("ВидДокумента",ВидДокумента));
	
	Для Каждого СтрПрефикса Из НайдСтроки Цикл
		
		БылиОшибки = Ложь;
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Номер");
		ТЗ.Колонки.Добавить("Дата");
		ТЗ.Колонки.Добавить("Статус");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДокументСсылка.Номер,
		               |	НАЧАЛОПЕРИОДА(ДокументСсылка.Дата, ДЕНЬ) КАК Дата,
		               |	ВЫБОР
		               |		КОГДА ДокументСсылка.Проведен
		               |			ТОГДА 1
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА ДокументСсылка.ПометкаУдаления
		               |					ТОГДА 2
		               |				ИНАЧЕ 3
		               |			КОНЕЦ
		               |	КОНЕЦ КАК Статус
		               |ИЗ
		               |	Документ." + ВидДокумента + " КАК ДокументСсылка
		               |ГДЕ
		               |	ДокументСсылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		               |	И ДокументСсылка.Организация = &Организация
		               |	И ПОДСТРОКА(ДокументСсылка.Номер, 1, &ДлинаПрефикса) = &Префикс";
		
		Запрос.УстановитьПараметр("Префикс", СтрПрефикса.Префикс);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Период.ДатаНачала));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Период.ДатаОкончания));
		Запрос.УстановитьПараметр("Организация", СтрПрефикса.Организация);
		Запрос.УстановитьПараметр("ДлинаПрефикса", СтрДлина(СтрПрефикса.Префикс));
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		ДлинаОснНомера = СтрПрефикса.ДлинаНомера - СтрДлина(СтрПрефикса.Префикс) - СтрДлина(СтрПрефикса.Постфикс);
		
		Пока Выборка.Следующий() Цикл
			
			Попытка
				Номер = Число(Сред(Выборка.Номер,СтрДлина(СтрПрефикса.Префикс)+1,ДлинаОснНомера));
			Исключение
				Продолжить;
			КонецПопытки;
			
			ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Новый Структура("Номер,Дата,Статус", Номер, Выборка.Дата, Выборка.Статус));
			
		КонецЦикла;
		
		ТЗ.Сортировать("Номер");		
		
		ТекДата = ТЗ[0].Дата;
		ТекНомер = ТЗ[0].Номер;
		
		Для каждого ТекСтр Из ТЗ Цикл
			
			Если ТЗ.Индекс(ТекСтр) = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			//Нашли интервал свободных номеров
			Если ТекСтр.Номер - ТекНомер > 1 Тогда 	 
				
				ТекНомер = ТекНомер + 1;
				
				Пока ТекНомер < ТекСтр.Номер  Цикл
					
					ТекДата = ТекСтр.Дата;
					НовСтр = ТаблицаНомеров.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрПрефикса);
					ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("НомерЧисловой,Дата", ТекНомер, ТекДата));
					
					НомерСтр = Прав("00000000000000" + СтрЗаменить(ТекНомер, Символы.НПП, ""), ДлинаОснНомера);
					НомерСтр = СокрЛП(СтрПрефикса.Префикс) + НомерСтр + СокрЛП(СтрПрефикса.Постфикс);
					
					Если СтрДлина(НомерСтр) <> СтрПрефикса.ДлинаНомера Тогда
						
						ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю("Для префикса '" + СтрПрефикса.Префикс + "' и '" + СтрПрефикса.Постфикс + "' сформировался номер неверной длины '" + НомерСтр + "'");
						БылиОшибки = Истина;
						Прервать;
						
					Иначе
						НовСтр.Номер = НомерСтр;
					КонецЕсли;
					
					ТекНомер = ТекНомер + 1;
					
				КонецЦикла; 
				
			Иначе 	//ищем дальше
				
				ТекДата = ТекСтр.Дата;
				ТекНомер = ТекСтр.Номер;
				
			КонецЕсли;
			
			Если БылиОшибки Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;	
	
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	//Готовим ТЗ
	Период.ДатаНачала = ЭтотОбъект.ДатаНачала;
	Период.ДатаОкончания = КонецДня(ЭтотОбъект.ДатаОкончания);
	
	Если Год(Период.ДатаНачала) <> Год(Период.ДатаОкончания) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Период должен быть выбран в рамках одного календарного года");
		Возврат;
		
	КонецЕсли;
	
	ПодготовитьТаблицуПрефиксовРТУиСФ();
	ТаблицаНомеров.Очистить();
	ЗаполнитьСвободныеНомера("СчетФактураВыданный");
	ЗаполнитьСвободныеНомера("РеализацияТоваровУслуг");
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
	// - Если сделать так, как показано выше(рекомендуют на некоторых ресурсах), то при изменении настроек в режиме клиента
	// этих изменений Вы не увидите, потому что настройки всегда будут по умолчанию. Как правильно - вариант ниже
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
 
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ВнешнийНаборДанных = Новый Структура("ТаблицаНомеров", ТаблицаНомеров); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки); 
	
	ДокументРезультат.Очистить();
	
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
